{
  "Projects": [
    {
      "title": "Homepage",
      "date": "Mar 2020 - Present",
      "descriptionbrief": "What you're looking at right now: my personal website!",
      "descriptionmain1": "I'm proud to say that I have built my own personal website from scratch. Websites are great ways to only display personal projects, but also hobbies and interests so you can get to learn a little more about me. React is a powerful tool for creating clean and organized UI. I chose 'Off-White', Virgil Abloh's signature designer brand, as my main theme.",
      "descriptionmain2": "I constructed this website using React.js and modifying it to deploy through Github Pages. For the 'Projects' sections, my website dynamically renders the designs based on a JSON file. That way, if I have any new projects I can simply add it into my JSON file and the website will do the rest of the work. I personally have never taken classes on these languages/tools, so this website has been a fruitful learning experiences for me!",
      "descriptiontools": "Tools: HTML, CSS, Javascript, React JS, Bootstrap",
      "tools": ["html", "css", "javascript", "reactjs", "bootstrap"],
      "github": "https://github.com/mrthomaschin/home",
      "imgURL": "/homepage-img.png",
      "section": "section-4"
    },
    {
      "title": "R'Mailbox",
      "date": "Mar 2020 - Present",
      "descriptionbrief": "An IoT Mailbox designed to keep your packages safe. Goodbye mail theft.",
      "descriptionmain1": "For our embedded-systems senior design project, our team wanted to design a system that could tackle a current problem. Mail theft has been prevalent around the country, with countless videos of passerbys swooping up packages off people's front porch. The R'Mailbox provides a safe and secure alternative for delivering packages while homeowners are out of the house.",
      "descriptionmain2": "The R'Mailbox utilizes a Raspberry Pi and ATMega1284 connected together via SPI. IR sensors detect when packages are placed inside and locks the door the moment it is shut. We implemented facial recognition and a finger print scanner to open the door. Mail services can also press a button which sends an SMS text to the user, to which he/she can unlock the door remotely. Lastly, we added AWS integration which lets users know when packages arrive and/or when the door is opened or closed.",
      "descriptiontools": "Tools: C++, Python, Amazon AWS, ATMega1284, Raspberry Pi, Travis CI, Embedded-Systems",
      "tools": ["c++", "python", "aws", "atmega", "raspberrypi", "travis"],
      "github": "https://github.com/mrthomaschin/CS179J-Team3",
      "imgURL": "/rmailbox-img.png",
      "section": "section-2"
    },
    {
      "title": "Tboard",
      "date": "Oct 2019 - Dec 2019",
      "descriptionbrief": "Arduino-powered electric skateboard. Controlled with a Wii Nunchuck. Way too much fun.",
      "descriptionmain1": "As a UCR student living off-campus, I believe that a suitable method of transportation is essential. uring previous years, I have commuted to campus using various forms of transportation including bikes, skateboards, public buses, and by car, and all seem to have a downside to them. Recently, the use of rental electric vehicles have grown substantially and have impacted the way people commute. An electric skateboard would be an efficient and easy way for a student to get to campus. It maintains the size of a regular skateboard, eliminates the use for a bike lock, decreases the time it takes to get to campus, and saves the user money from gas and parking expenses.",
      "descriptionmain2": "The Tboard is an Arduino-powered electric skateboard. An Arduino is connected to the skateboard's speed controller via UART. An Arduino is connected to the skateboard's speed controller via UART. It has built-in headlights and tail lights, as well as two sensors on top of the longboard deck to detect foot placement. A built-in speaker plays specific tones upon startup and foot-sensor detection for an enjoyable user experience. A power switch and battery level indicator are built into the electronics housing. It is also controlled with a wireless Wii Nunchuk. The Tboard boasts a speed of over 20+ mph with a battery life that lasts 10-12 miles on a single charge. And in summary, the cost of this project came down to 1/5th the price of the standard Boosted Board. And most of all, it's fun!",
      "descriptiontools": "Tools: C++, Arduino, Wii, UART, Embedded Systems",
      "tools": ["c++", "arduino", "uart", "wii"],
      "github": "https://github.com/mrthomaschin/Tboard",
      "imgURL": "/tboard-img.png",
      "section": "section-3"
    },
    {
      "title": "MindTAPP",
      "date": "May 2019 - Jan 2020",
      "descriptionbrief": "Survey website for UC Riverside's Leadership and Group Dynamics psychology research lab.",
      "descriptionmain1": "I was one of a team of four to develop and maintain the website for the Leadership and Group Dynamics Lab in UCR's psychology research department, lead by Dr. Thomas Sy. The website contains all information about the research program, as well as all the surveys required for the study.",
      "descriptionmain2": "The website is built using the ASP .NET Core framework and structured in a Model-View-Controller pattern. I currently am one of the two members on the back-end team, sending data to and from our Firebase database through Cloud Firestore.",
      "descriptiontools": "Tools: HTML, CSS, Javascript, ASP .NET Core MVC, Firebase",
      "tools": ["html", "css", "javascript", "dotnetcore", "firebase"],
      "github": "https://mindtapp.com/#about",
      "imgURL": "/mindtapp-img.png",
      "section": "section-5"
    },
    {
      "title": "BioHack",
      "date": "Jan 2019 - May 2019",
      "descriptionbrief": "Official website for UC Riverside's Biohack Hackathon.",
      "descriptionmain1": "I was one of the website developers for UC Riverside's BioHack hackathon. This website consisted of all the information about BioHack as well as a countdown to the hackathon and a live website during the event with constant updates through social media.",
      "descriptionmain2": "I contributed by adding new sponsors to the page and update the website with any announcements. I also helped create the live website by implementing the Instagram UI into the website for live updates.",
      "descriptiontools": "Tools: HTML, CSS, Javascript, Bootstrap",
      "tools": ["html", "css", "javascript", "bootstrap"],
      "github": "https://github.com/mrthomaschin/BioHack_2019",
      "imgURL": "/biohack-img.png",
      "section": "section-6"
    }
  ]
}
